In [244]:
import pandas as pd
pd.options.display.max_columns = 101
import numpy as np

In [245]:
df = pd.read_csv('messy_IMDB_dataset.csv', sep=';', encoding="ISO-8859-1")

In [246]:
df.head()

,IMBD title ID,Original titlÊ,Release year,Genrë¨,Duration,Country,Content Rating,Director,Unnamed: 8,Income,Votes,Score
0,tt0111161,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,NaN,$ 28815245,2.278.845,9.3
1,tt0068646,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,NaN,$ 246120974,1.572.674,9.2
2,tt0468569,The Dark Knight,23 -07-2008,"Action, Crime, Drama",152,US,PG-13,Christopher Nolan,NaN,$ 1005455211,2.241.615,9.
3,tt0071562,The Godfather: Part II,1975-09-25,"Crime, Drama",220,USA,R,Francis Ford Coppola,NaN,"$ 4o8,035,783",1.098.714,"9,.0"
4,tt0110912,Pulp Fiction,1994-10-28,"Crime, Drama",,USA,R,Quentin Tarantino,NaN,$ 222831817,1.780.147,"8,9f"

In [247]:
df.shape

(101, 12)

In [248]:
df.dtypes

IMBD title ID      object
Original titlÊ     object
Release year       object
Genrë¨             object
Duration           object
Country            object
Content Rating     object
Director           object
Unnamed: 8        float64
Income             object
 Votes             object
Score              object
dtype: object

In [249]:
df.drop(['Unnamed: 8', 'IMBD title ID'], axis=1, inplace=True)

In [250]:
df.rename(columns={'Original titlÊ': 'Original Title', 'Genrë¨': 'Genre',  ' Votes': 'Votes'}, inplace=True)

In [251]:
df.isnull().sum()

Original Title     1
Release year       1
Genre              1
Duration           2
Country            1
Content Rating    24
Director           1
Income             1
 Votes             1
Score              1
dtype: int64

In [252]:
null_mask = df['Original Title'].isnull()
null_rows = df[null_mask]
null_rows

,Original Title,Release year,Genre,Duration,Country,Content Rating,Director,Income,Votes,Score
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [253]:
null_mask = df['Duration'].isnull()
null_rows = df[null_mask]
null_rows

,Original Title,Release year,Genre,Duration,Country,Content Rating,Director,Income,Votes,Score
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,The Matrix,1999-05-07,"Action, Sci-Fi",NaN,USA,R,"Lana Wachowski, Lilly Wachowski",$ 465718588,1.632.315,++8.7

In [254]:
df = df.drop(df.index[13])

In [255]:
np.sum(df == 'NA', axis = 0) + np.sum(df == 'N/A', axis = 0)

Original Title    0
Release year      0
Genre             0
Duration          0
Country           0
Content Rating    0
Director          0
Income            0
 Votes            0
Score             0
dtype: int64

In [256]:
with pd.option_context('display.max_rows', None):
    print(df["Content Rating"].value_counts(dropna=False))

R            45
NaN          23
PG-13        12
PG           11
G             6
Not Rated     1
Approved      1
Unrated       1
Name: Content Rating, dtype: int64

In [257]:
df.loc[df['Content Rating'] == 'Not Rated', 'Content Rating'] = 'Unrated'

In [258]:
with pd.option_context('display.max_rows', None):
    print(df["Genre"].value_counts(dropna=False))

Drama                            9
Crime, Drama                     8
Action, Adventure, Drama         6
Crime, Drama, Thriller           4
Biography, Drama, History        3
Action, Adventure, Sci-Fi        3
Animation, Adventure, Family     3
Western                          3
Action, Adventure, Fantasy       3
Drama, War                       3
Action, Adventure                2
Animation, Adventure, Comedy     2
Mystery, Thriller                2
Action, Sci-Fi                   2
Drama, Romance                   2
Action, Crime, Drama             2
Drama, Romance, Sci-Fi           1
Drama, Mystery, Thriller         1
Comedy, Drama                    1
Animation, Adventure, Fantasy    1
Comedy, Drama, War               1
Drama, Film-Noir                 1
Adventure, Drama, War            1
Animation, Action, Adventure     1
Drama, Mystery                   1
Comedy, Crime                    1
Crime, Drama, Sci-Fi             1
Comedy, Romance                  1
Adventure, Sci-Fi                1
Action, Drama, Mystery           1
Mystery, Romance, Thriller       1
Adventure, Mystery, Thriller     1
Adventure, Biography, Drama      1
Comedy, Crime, Drama             1
Adventure, Drama, Thriller       1
Comedy                           1
Animation, Drama, War            1
Drama, Mystery, War              1
Horror, Sci-Fi                   1
Biography, Crime, Drama          1
Adventure, Drama, Sci-Fi         1
Crime, Drama, Mystery            1
Crime, Drama, Fantasy            1
Comedy, Drama, Romance           1
Comedy, Drama, Thriller          1
Drama, Family, Fantasy           1
Drama, Mystery, Sci-Fi           1
Adventure, Comedy, Sci-Fi        1
Crime, Mystery, Thriller         1
Animation, Adventure, Drama      1
Biography, Comedy, Drama         1
Biography, Drama, Music          1
Drama, Music                     1
Horror, Mystery, Thriller        1
Drama, Romance, War              1
Comedy, Drama, Family            1
Drama, Western                   1
Drama, Horror                    1
Comedy, Musical, Romance         1
Name: Genre, dtype: int64

In [259]:
# I attempted to code each genre as a seperate column but i did not do it properly, here is the code I tried.

# # split the "Genre" column by comma and create a new DataFrame with dummy variables
# genre_dummies = df['Genre'].str.get_dummies(', ')

# # concatenate the original DataFrame and the dummy variables DataFrame
# df = pd.concat([df, genre_dummies], axis=1)

# df.drop(['Genre'], axis=1, inplace=True)

In [260]:
df.head()

,Original Title,Release year,Genre,Duration,Country,Content Rating,Director,Income,Votes,Score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2
2,The Dark Knight,23 -07-2008,"Action, Crime, Drama",152,US,PG-13,Christopher Nolan,$ 1005455211,2.241.615,9.
3,The Godfather: Part II,1975-09-25,"Crime, Drama",220,USA,R,Francis Ford Coppola,"$ 4o8,035,783",1.098.714,"9,.0"
4,Pulp Fiction,1994-10-28,"Crime, Drama",,USA,R,Quentin Tarantino,$ 222831817,1.780.147,"8,9f"

In [261]:
with pd.option_context('display.max_rows', None):
    print(df["Country"].value_counts(dropna=False))

USA             62
UK              12
Italy            4
Japan            4
France           3
South Korea      2
Germany          2
New Zesland      1
New Zealand      1
New Zeland       1
US.              1
Brazil           1
US               1
Italy1           1
India            1
Denmark          1
West Germany     1
Iran             1
Name: Country, dtype: int64

In [262]:
df.loc[df['Country'] == 'US', 'Country'] = 'USA'
df.loc[df['Country'] == 'US.', 'Country'] = 'USA'
df.loc[df['Country'] == 'West Germany', 'Country'] = 'Germany'
df.loc[df['Country'] == 'New Zesland', 'Country'] = 'New Zealand'
df.loc[df['Country'] == 'New Zeland', 'Country'] = 'New Zealand'
df.loc[df['Country'] == 'Italy1', 'Country'] = 'Italy'

In [263]:
with pd.option_context('display.max_rows', None):
    print(df["Income"].value_counts(dropna=False))

$ 28815245       1
$ 77356942       1
$ 475347111      1
$ 213216216      1
$ 356296601      1
$ 321455689      1
$ 299645         1
$ 969879         1
$ 5472914        1
$ 169785629      1
$ 60262836       1
$ 375540831      1
$ 807083670      1
$ 246120974      1
$ 37032034       1
$ 9443876        1
$ 15002116       1
$ 91968688       1
$ 2797800564     1
$ 108110316      1
$ 2048359754     1
$ 390133212      1
$ 46520613       1
$ 521311860      1
$ 2889963        1
$ 74036715       1
$ 404265438      1
$ 225933435      1
$ 22926076       1
$ 15000000       1
$ 11487676       1
$ 156000000      1
$ 45710874       1
$ 15843274       1
$ 73446          1
$ 7796389        1
$ 52066791       1
$ 384857224      1
$ 1594107        1
$ 68989547       1
$ 131384634      1
$ 46357676       1
$ 173924742      1
$ 28441292       1
$ 66023585       1
$ 1066969703     1
$ 26903440       1
$ 7390108        1
$ 83557872       1
$ 39970386       1
$ 425368238      1
$ 1081133191     1
$ 30680793       1
$ 482349603      1
$ 775768912      1
$ 272753884      1
$ 327333559      1
$ 696742056      1
$ 108997629      1
$ 46879633       1
$ 549265501      1
$ 951227416      1
$ 465718588      1
$ 25252481       1
$ 887934303      1
$ 678229452      1
$ 101218804      1
$ 869784991      1
$ 576            1
$ 322287794      1
$ 1142271098     1
$ 222831817      1
$ 4o8,035,783    1
$ 1005455211     1
$ 286801374      1
$ 355467056      1
$ 457688         1
$ 230098753      1
$ 13826605       1
$ 516962         1
$ 112911         1
$ 4374761        1
$ 32008644       1
$ 48983260       1
$ 120072577      1
$ 426588510      1
$ 1074251311     1
$ 968511805      1
$ 23341568       1
$ 520884847      1
$ 19552639       1
$ 23875127       1
$ 388774684      1
$ 109676311      1
$ 291465034      1
$ 465361176      1
$ 322773         1
$ 6130720        1
$ 257604912      1
$ 1864182        1
Name: Income, dtype: int64

In [264]:
df.loc[df['Income'] == '$ 4o8,035,783', 'Income'] = '$ 408,035,783'
df['Income'] = df['Income'].str.replace('$', '').str.replace(',', '')

/var/folders/4b/z0w6x5_n59g_x_9s3qnbx_p80000gn/T/ipykernel_58828/2246345171.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Income'] = df['Income'].str.replace('$', '').str.replace(',', '')

In [265]:
df.head()

,Original Title,Release year,Genre,Duration,Country,Content Rating,Director,Income,Votes,Score
0,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,28815245,2.278.845,9.3
1,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,246120974,1.572.674,9.2
2,The Dark Knight,23 -07-2008,"Action, Crime, Drama",152,USA,PG-13,Christopher Nolan,1005455211,2.241.615,9.
3,The Godfather: Part II,1975-09-25,"Crime, Drama",220,USA,R,Francis Ford Coppola,408035783,1.098.714,"9,.0"
4,Pulp Fiction,1994-10-28,"Crime, Drama",,USA,R,Quentin Tarantino,222831817,1.780.147,"8,9f"

In [266]:
# This was also running an error for me and I cannot figure out why.

# with pd.option_context('display.max_rows', None):
#     print(df["Votes"].value_counts(dropna=False))
# df['Votes'] = df['Votes'].str.replace('.', '')

In [267]:
df["Income"] = df["Income"].astype(np.int64)

In [268]:
# Getting an error for this but I am not sure why

# df["Duration"] = df["Duration"].astype(np.int64)